The changes for this has been implemented.  @kevinCodeSavvy  Could you give it a try on your end and update ?

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_ivs_stage.basic will be created
  + resource "awscc_ivs_stage" "basic" {
      + active_session_id                        = (known after apply)
      + arn                                      = (known after apply)
      + auto_participant_recording_configuration = (known after apply)
      + id                                       = (known after apply)
      + name                                     = "basic-ivs-stage"
      + tags                                     = [
          + {
              + key   = "Modified By"
              + value = "AWSCC"
            },
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_ivs_stage.basic: Creating...
awscc_ivs_stage.basic: Creation complete after 5s [id=arn:aws:ivs:us-east-1:############:stage/aDRvMplWCphO]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

❯ tfy
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
awscc_ivs_stage.basic: Refreshing state... [id=arn:aws:ivs:us-east-1:############:stage/aDRvMplWCphO]
data.aws_caller_identity.current: Read complete after 0s [id=############]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration and found no differences, so no changes are needed.

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.

```